[{
    "name": "Company",
    "iscontent": [{
        "id": "Company",
        "title": "The Company",
        "text": "Aerosun-Futai has been designing and manufacturing flexible elements such as metal bellows, welded bellows, metal hose and metal expansion joints for the industries since 1960s and is a leading designer and manufacturer of metal bellows and expansion joints in China, specializing in exhaust pipe system of diesel and gas engine and gas insulated substation (GIS).<br/><br/>Aerosun-Futai designs, manufactures and services a wide range of high performance bellows type products and expansion joints. This large range of products is highlighted by the metal bellows and welded bellows for mechanical sealing and vacuum system, expansion joints for exhaust piping in ship-building, diesel engine, automotive and for GIS in power transmission. The Aerosun-Futai families of bellows products are in service around the fields in power generation and transmission, refineries, chemical plants, pulp & paper mills, steel mills, district heating, vacuum and refrigeration machinery, space and aviation.<br/><br/>In being a development partner for customers in the power transmission industry, mechanical industry, diesel engine and other markets, the close cooperation between the customers and Aerosun-Futai's research institute is very important. Leave your application requests to our highly qualified engineers and you’ll get satisfied solution.<br/><br/>"
    },
    {
        "id": "Group",
        "title": "The Group",
        "text": "Aerosun-Futai is a holding subsidiary of Aerosun Corporation based in Nanjing, China. Aerosun Corporation is a public limited company initiated in 1999 by Nanjing Chenguang Group and is the largest research and manufacturing base of metal hose and expansion joints in Asia. Aerosun has production plants and sales offices throughout China. Click www.aerosun.cn for further information of Aerosun Corporation.<br/><br/>"
    },
    {
        "id": "Production",
        "title": "Production",
        "text": "Aerosun-Futai started its production of flexible elements for valve, vacuum technology, and measurement and control systems in 1960s. With the requirements of the industrial applications, Aerosun-Futai started to make expansion joints for diesel and turbine, automotive, GIS and other industries. Today, Aerosun-Futai has becoming the large base of Aerosun Corporation for research and production of bellows products in northern area of China and the largest manufacturer of expansion joints for GIS industry in China.<br/><br/>"
    },
    {
        "id": "Capability",
        "title": "Capability",
        "text": "Aerosun-Futai is one of the leading manufacturing company of expansion joints in China. Its manufacturing floor area - 16,000 sq. meters and total land area - 35000 sq. meters. With our team of highly skilled engineers and designers, we will help you to find the best solution for your applications by utilizing state of the art equipment and software. Aerosun-Futai uses three methods to form its metallic and multilayer bellows for diameter from 50mm up to 7000mm, which is elastomeric, expansion and hydraulic forming.<br/><br/>"
    },
    {
        "id": "Quality",
        "title": "Quality",
        "text": "Aerosun-Futai has started to develop its Quality Assurance System since 1980’s to fulfill each one of our customers’ needs in terms of products and before/after sales services. Aerosun-Futai maintains the Certificates for the fabrication of expansion joints issued by both domestic and European based agencies such as:<br/><a href='' class='title_a'>ISO9001 Certificate of QMS</a><br/><a href='' class='title_a'>Manufacture License of Special Equipment (Pressure Pipe)</a><br/><a href='' class='title_a'>PED 97/23/EG——Welder Approval Test Certificates</a><br/><br/>The Aerosun-Futai Quality Control capabilities include the following NDE ways and Inspection/Test methods: PT, RT, UT, Hydrostatic/Pneumatic Pressure Testing, SF6/Helium Leak Testing, Hardness Testing and Inspection of Coating Thickness.<br/><br/>"
    },
    {
        "id": "Services",
        "title": "Services",
        "text": "Aerosun-Futai provides a variety of services to meet the needs of our customers:<br/><br/><span class='title_a'>Engineering and Design</span><br/>&nbsp;&nbsp;&nbsp;&nbsp;--Finite Element Analysis<br/>&nbsp;&nbsp;&nbsp;&nbsp;--Stress Analysis for Pipe with Expansion Joints<br/><span class='title_a'>Expansion Joint Design</span><br/><span class='title_a'>Value-added Services</span><br/>&nbsp;&nbsp;&nbsp;&nbsp;--Product testing<br/><span class='title_a'>On-site Field Services</span><br/><br/>"
    }]
},
{
    "name": "Products",
    "iscontent": [{
        "id": "metal_bellows",
        "title": "Metal Bellows",
        "text": "Aerosun-Futai manufactures standard and custom hydroformed metal bellows and assemblies. We offer about 50 years experience in the design of single and multiply bellows in various materials and sizes from 9.5mm diameter and larger.<br/><br/>\n \n\n<span class='title_a'>MATERIAL</span><br/>\nCopper Alloy<br/>\nAustenitic Stainless Steels<br/><br/>\n\n \n\nClick Here for <a href='images/files4.pdf' target='_blank' id='a_line'>Standard Bellows</a><br/>\n\nClick Here for <a href='images/files5.pdf' target='_blank' id='a_line'>Custom Bellows</a><br/><br/>\n\n \n\n<span class='title_a'>PRODUCT APPLICATIONS</span><br/>\n• Vacuum Technology<br/>\n• Valve Industry<br/>\n• General Engineering<br/>\n• Measurement and Control Systems<br/>\n• Weight Technology<br/>\n• Bellows Used as Couplings<br/>\n• Solar Technology<br/>\n• Shaft Seals<br/>\n• Volume/Pressure Compensation<br/><br/>"
    },
    {
        "id": "welded_bellows",
        "title": "Welded Bellows",
        "text": "Aerosun-Futai has fabricated custom welded bellows and assemblies for our customers for about 40 years. We offer welded bellows in various materials and sizes from 9mm diameter to 400mm and min. thickness 0.076mm.<br/><br/>\n \n\n<span class='title_a'>MATERIAL</span><br/>\nAustenitic Stainless Steels<br/>\nAM350<br/>\nHastelloy C alloys<br/>\nHaynes alloy 242<br/>\nInconel 625 and 718<br/>\nTitanium<br/><br/>\n\n \n\n<span class='title_a'>PRODUCT APPLICATIONS</span><br/>\n• High-vacuum Technology<br/>\n• Electronic Technology<br/>\n• Mechanical Seals<br/>\n• Valve Industry<br/>\n• Semiconductor Industry<br/>\n• Measurement and Control Systems<br/>\n• Vibration isolator<br/><br/>\n \n\n<p style=\"text-align:center;\">Convolution Configurations</p>\n<img src=\"images/pic1.jpg\"/><br/><br/>\n\n\n\n\nFor Standard Welded Bellows <a href='images/files6.pdf' target='_blank' id='a_line'>Click Here</a><br/>\nFor Custom Welded Bellows <a href='images/files7.pdf' target='_blank' id='a_line'>Click Here</a><br/><br/>"
    },
    {
        "id": "metal_hose",
        "title": "Metal Hose",
        "text": "Aerosun-Futai Metal Hose Assemblies are available in a variety of 300 series stainless steels, from 6mm thru 600mm nominal inside diameters. Aerosun-Futai offers a wide variety of Flexible Metal Hoses to meet the most stringent requirements of all industrial and commercial applications.<br/><br/>"
    },
    {
        "id": "expansion_joints",
        "title": "Expansion Joints",
        "text": "Aerosun-Futai started to design and manufacture the expansion joint products about 50 years ago. Since then our expansion joints line kept widening and improving to fulfill the most sophisticated appliance required by our customers. Aerosun-Futai is the first manufacturer in China which designs and fabricated expansion joints for diesel exhaust piping system and gas insulated substation industries, and its bellows products are used in a wide variety of piping applications to compensate for piping displacement due to temperature difference, and to absorb equipment vibration or pipe motions. Aerosun-Futai is the name recognized in China as the leader in bellows industry for its reliable products.<br/><br/>"
    },
    {
        "id": "engineering",
        "title": "Engineering",
        "text": "Using state of the art software such as 3D modeling software along with finite element analysis (FEA), Aerosun-Futai’s engineers can analyze the performance of the expansion joint and design a safe and reliable product to meet your specifications with lower cost.<br/>\nBellows is the key element of the expansion joint. Aerosun-Futai uses the equations shown in the Standards of Expansion Joint Manufacturer's Association as the basis for their bellows designs.<br/>\nAerosun-Futai is one of the main writers of the Chinese Standards JB/T 10617 and TB/T2726.<br/>\nThe following standards or codes may be used to design and to manufacture expansion joints:<br/>\n• Chinese Standards: GB/T 12777, GB 16749, GB/T 12522, JB/T 10617 and TB/T2726<br/>\n• EJMA<br/>\n• ASME B31.1 and ASME B31.3<br/>\n• EN 13445 (Chap. 14 for PED compliance)<br/>\n• EN 14917<br/>\n• PED 97/23/EC<br/>\nConsult with Aerosun-Futai for another design code required.<br/><br/>"
    },
    {
        "id": "types_of_products",
        "title": "Types of Products",
        "text": "Aerosun-Futai manufactures various types of expansion joints with single and/or multiply bellows sized from 50mm to over 5000mm in diameter. Bellows materials utilized include stainless steels, nickel based alloys, titanium and many others for extreme pressure, temperature and corrosive conditions.<br/><br/>\n\n \n\n<span class='title_a'>EXPANSION JOINT PRODUCTS</span><br/>\n• Single & Universal Expansion Joints<br/>\n• Universal Tied Expansion Joints<br/>\n• Pressure Balanced Expansion Joints (Elbow, In-Line and By-Pass)<br/>\n• Single & Double Hinge & Gimbal Expansion Joints<br/><br/>"
    },
    {
        "id": "test",
        "title": "Test",
        "text": "Aerosun-Futai is capable to perform in-house testing such as spring rate testing, movement capability testing, pressure and stress testing, vacuum and leak testing, fatigue testing and burst testing etc. In addition to utilizing these tests to further our own knowledge of expansion joints, it can be utilized for customer specific expansion joint testing.<br/><br/>The bellows expansion joint is a flexible element and also the weak point in piping system. This must to be kept in mind in the whole procedure of product designing, materials choosing and manufacturing. To ensure the highest degree of reliability, we perform the following tests on request during construction of expansion joint in addition to dimensional control:<br/>Material Test (Hardness, Tensile, Elongation and Chemical Composition)<br/>NDT Test (PT, RT and UT) <br/>Hydrostatic/Pneumatic Pressure Test<br/>SF6/Helium Leak Test<br/>Inspection of Coating Thickness.<br/><br/>"
    },
    {
        "id": "application",
        "title": "Application",
        "text": "Aerosun-Futai expansion joints are mainly used in following industrial applications:<br/>Power Generation Market<br/>Solar Technology<br/>Cryogenic/Industrial Gases<br/>Steel Mills/Metals<br/>Measurement and Control Systems<br/>Vacuum and High-Vacuum Technology<br/>Fuel Cell Power System<br/>Pulp and Paper<br/>Oil and Gas Distribution<br/>Gas Insulated Substation and Electrical Distribution Market<br/>General Engineering<br/>Weight Technology<br/>Bellows Used as Couplings<br/>Shaft Seals<br/>Volume/Pressure Compensation<br/>Instrument Engineering (Valve Technology)<br/>Ship-building and Repair<br/>Chemical Processing<br/>Water/Waste Water<br/>Nuclear<br/>Petro Chemical / Refinery Market<br/>Heat Exchanger<br/><br/>"
    },
    {
        "id": "materials",
        "title": "Materials",
        "text": "Aerosun-Futai uses the following materials in its expansion joint construction:<br/>\n<table width=\"100%\" border=\"1\" align=\"left\" cellpadding=\"0\" cellspacing=\"0\">\n  <tr>\n    <td valign=\"middle\"><p>Parts</p></td>\n    <td valign=\"middle\"><p>Commonly used Materials for Expansion Joints</p></td>\n    <td valign=\"middle\"><p>Materials on Request</p></td>\n  </tr>\n  <tr>\n    <td valign=\"middle\"><p>Bellows</p></td>\n    <td valign=\"middle\"><p>Austenitic Stainless Steels </p></td>\n    <td valign=\"middle\"><p>Duplex    Stainless Steels <br>\n      Nickel Alloys<br>\n    Titanium</p></td>\n  </tr>\n  <tr>\n    <td valign=\"middle\"><p>Weld Ends</p></td>\n    <td valign=\"middle\"><p>Common carbon steels<br>\n    Austenitic Stainless Steels </p></td>\n    <td valign=\"middle\"><p>Nickel    Alloys<br>\n    Titanium </p></td>\n  </tr>\n  <tr>\n    <td valign=\"middle\"><p>Flanges</p></td>\n    <td valign=\"middle\"><p>Common carbon steels<br>\n    Austenitic Stainless Steels </p></td>\n    <td valign=\"middle\"><p>Nickel    Alloys<br>\n      Aluminum <br>\n    Titanium </p></td>\n  </tr>\n  <tr>\n    <td valign=\"middle\"><p>Rods systems</p></td>\n    <td valign=\"middle\"><p>Common carbon steels</p></td>\n    <td valign=\"middle\"><p>Austenitic Stainless Steels </p></td>\n  </tr>\n</table><br/>"
    }]
}]
